In [6]:
import pandas as pd
import numpy as np

In [3]:
rows = 10

In [160]:
int_col = np.random.randint(0, rows, size=rows)
num_col = np.random.random_sample(rows)
chr_col = [''.join([chr(i) for i in np.random.randint(ord('а'), ord('я'), 5)]) for _ in range(rows)]
word_col = ['кошка', 'собака', 'ЯБЛОКО', 'АПЕЛЬСИН', 'Дерево', 'Машина', 'Car', 'House', 'Дом', 'кошка']
lists = [int_col, num_col, chr_col, word_col]
mix_col = [lists[np.random.randint(len(lists))][np.random.randint(rows)] for _ in range(rows)]

In [161]:
df = pd.DataFrame({'int_col': int_col, 
                   'num_col': num_col, 
                   'chr_col': chr_col, 
                   'word_col': word_col,
                   'mix_col': mix_col,
                  })

In [162]:
df

   int_col   num_col chr_col  word_col   mix_col
0        7  0.581952   чиьфс     кошка     чиьфс
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
9        6  0.971932   ытлфь     кошка     ьюжыз

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   int_col   10 non-null     object
 1   num_col   10 non-null     float64
 2   chr_col   10 non-null     object
 3   word_col  10 non-null     object
 4   mix_col   10 non-null     object
dtypes: float64(1), object(4)
memory usage: 528.0+ bytes

In [120]:
[np.random.randint(3) for _ in range(20)]

[2, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 2, 2, 2, 1]

## Data Types and Conversion

##### переводит Series в тип численный тип данных. Будут ошибки, если в наборе данных строки содержат не числовые значения

In [126]:
# все значения цифровые
pd.to_numeric(df['int_col'])

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: int_col, dtype: int64

In [127]:
# смешанные поля цифры и строки - ошибка
pd.to_numeric(df['mix_col'])

ValueError: Unable to parse string "иккзз" at position 0

##### Переводит Series в числовой тип, при этом заменяет не числовые значения на NaN

In [139]:
# pd.to_numeric(.., errors - аргумент для управления поведением при встрече не числовых значений)
#     'raise' - по умолчанию вызывает ошибку
#     'coerce' - заменяет не числовые на NaN
#     'ignore' - оставляет исходное значение
pd.DataFrame(
    {
        'original': df['mix_col'],
        'errors=coerce': pd.to_numeric(df['mix_col'], errors='coerce'), 
        'errors=ignore': pd.to_numeric(df['mix_col'], errors='ignore')
    }
)

   original  errors=coerce errors=ignore
0     иккзз            NaN         иккзз
1         7       7.000000             7
2     уздул            NaN         уздул
3     ъфииф            NaN         ъфииф
4         8       8.000000             8
5     рттчъ            NaN         рттчъ
6  0.400321       0.400321      0.400321
7         9       9.000000             9
8  0.436953       0.436953      0.436953
9     иккзз            NaN         иккзз

##### Смена типа данных у колонки DataFrame

In [159]:
pd.DataFrame(
    {
        'original': df['mix_col'],
        'errors=ignore': df.mix_col.astype(np.int64, errors='ignore'),
    }
)

   original errors=ignore
0         0             0
1         0             0
2         5             5
3         0             0
4         9             9
5  0.647119      0.647119
6     лфыче         лфыче
7  0.851594      0.851594
8  0.622595      0.622595
9  0.886704      0.886704

## Exploring anf Finding Data

#### Получение данных обо всех дублей в DataFrame по специфичным полям

In [163]:
df

   int_col   num_col chr_col  word_col   mix_col
0        7  0.581952   чиьфс     кошка     чиьфс
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
9        6  0.971932   ытлфь     кошка     ьюжыз

In [182]:
# keep : {'first', 'last', False}, default 'first'
#     Determines which duplicates (if any) to mark.
#     - ``first`` : Mark duplicates as ``True`` except for the first occurrence.
#     - ``last`` : Mark duplicates as ``True`` except for the last occurrence.
#     - False : Mark all duplicates as ``True``.

df[df.duplicated(['int_col',], keep=False)]

   int_col   num_col chr_col  word_col   mix_col
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН

In [179]:
df2 = pd.DataFrame(
    {
        'col1': [1, 2, 3, 1, 2, 3],
        'col2': [2, 2, 3, 1, 3, 3]
    }    
    
)
df2[df2.duplicated(['col1', 'col2'], keep=False)]

   col1  col2
2     3     3
5     3     3

##### Список уникальных значений в колонке DataFrame

In [181]:
df['int_col'].unique()

array([7, 5, 4, 2, 1, 6])

##### Для каждого уникального значения вывести частоту кол-ва использования

In [185]:
df['int_col'].value_counts()

5    3
4    2
2    2
7    1
6    1
1    1
Name: int_col, dtype: int64

##### Вывод всех записей DataFrame, где в определенном столбце встречается указанное значение

In [193]:
df.loc[df.word_col == 'кошка']

   int_col   num_col chr_col word_col mix_col
0        7  0.581952   чиьфс    кошка   чиьфс
9        6  0.971932   ытлфь    кошка   ьюжыз

##### Вывод всех записей DataFrame, где в определенном столбце встречаются перечень значений

In [381]:
valuelist = ['кошка', 'Дом', 'House']
df[df.word_col.isin(valuelist)]

   int_col  num_col chr_col word_col   mix_col
0        7     0.58   чиьфс    кошка     чиьфс
7        2     0.22   елчжз    House         4
8        4     0.65   пнфкц      Дом  АПЕЛЬСИН
9        6     0.97   ытлфь    кошка     ьюжыз

##### Вывод всех записей DataFrame, где в определенном столбце нет значений из переданного списка

In [196]:
valuelist = ['кошка', 'Дом', 'House']
df[~df.word_col.isin(valuelist)]

   int_col   num_col chr_col  word_col   mix_col
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН

##### Выборка значений из DataFrame по различным критериям 
(в примере ниже использовать | вместо & что бы использовать ИЛИ)

In [201]:
df[(df['word_col'] == 'кошка') & (df.num_col > 0.6)]

   int_col   num_col chr_col word_col mix_col
9        6  0.971932   ытлфь    кошка   ьюжыз

##### Поиск по сложным критериям вхождения списка ключевых слов

In [393]:
# Генерация шаблона регулярного выражения для поиска

def gen_pattern(words):
    if isinstance(words, str):
        words = list(words)

    base = r'^{}'
    expr = '(?=.*{})'
    return base.format(''.join(expr.format(w) for w in words))

In [395]:
# отбираем записи, где в тексте встречаются ['сложного', 'поиска'] и где отсутствует слово 'строка'
words = ['сложного', 'поиска']  # example

tmp_df = pd.DataFrame([
    ['Это строка для сложного поиска'],
    ['Какой-то еще текст и набор букв'],
    ['Нам надо много примеров для сложного поиска'],
    ['Поэтому мы создали еще одну строку для сложного поиска']
], columns = ['text'])
tmp_df[
    (tmp_df['text'].astype('str').str.contains(gen_pattern(words), case=False)) & 
    (tmp_df['text'].astype('str').str.contains(gen_pattern('поэтому'), case=False) == False)
]

                                          text
0               Это строка для сложного поиска
2  Нам надо много примеров для сложного поиска

In [407]:
tmp_df[
    (tmp_df['text'].astype('str').str.contains(gen_pattern(['поис', 'слож']), case=False)) &
    ~(tmp_df['text'].astype('str').str.contains(gen_pattern(['нам']), case=False))    
]

                                                text
0                     Это строка для сложного поиска
3  Поэтому мы создали еще одну строку для сложног...

##### Цикл по записям DataFrame

In [213]:
loops = 1
for index, row in df.iterrows():
    print(index, row['num_col'])
    print(row[['int_col', 'word_col']])
    print('='*20)
    loops += 1
    if loops > 3:
        break

0 0.5819520280440198
int_col         7
word_col    кошка
Name: 0, dtype: object
====================
1 0.4013787731727625
int_col          5
word_col    собака
Name: 1, dtype: object
====================
2 0.9130104408214264
int_col          4
word_col    ЯБЛОКО
Name: 2, dtype: object
====================

##### Намного более быстрый способ перебирать строки DataFrame, если вы можете работать с кортежами

In [225]:
loops = 1
for row in df.itertuples():
    print(row[1:-1])   
    loops += 1
    if loops > 3:
        break
row

(7, 0.5819520280440198, 'чиьфс', 'кошка')
(5, 0.4013787731727625, 'ьюжыз', 'собака')
(4, 0.9130104408214264, 'шцйжы', 'ЯБЛОКО')

Pandas(Index=2, int_col=4, num_col=0.9130104408214264, chr_col='шцйжы', word_col='ЯБЛОКО', mix_col=0.9130104408214264)

##### Получить первые n для каждой группы столбцов в отсортированном DataFrame 
(убедитесь, что DataFrame отсортирован первым)

In [234]:
n = 1
df.groupby(['int_col', 'word_col']).head(n)

   int_col   num_col chr_col  word_col   mix_col
0        7  0.581952   чиьфс     кошка     чиьфс
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
9        6  0.971932   ытлфь     кошка     ьюжыз

##### Получить из DataFrame записи, где выбранные поля пустые/не пустые

In [238]:
df[~df['mix_col'].isnull()]

   int_col   num_col chr_col  word_col   mix_col
0        7  0.581952   чиьфс     кошка     чиьфс
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
9        6  0.971932   ытлфь     кошка     ьюжыз

##### Срез значений в колонке DataFrame

In [243]:
pd.DataFrame(
    {
        'original': df.word_col,
        'slicce': df.word_col.str[1:-1]
    }
)

   original  slicce
0     кошка     ошк
1    собака    обак
2    ЯБЛОКО    БЛОК
3  АПЕЛЬСИН  ПЕЛЬСИ
4    Дерево    ерев
5    Машина    ашин
6       Car       a
7     House     ous
8       Дом       о
9     кошка     ошк

##### Быстрый подсчет количества строк в DataFrame

In [244]:
len(df.index)

10

##### Получить длину данных в колонке DataFrame

In [246]:
pd.DataFrame(
    {
        'original': df.word_col,
        'len': df.word_col.str.len()
    }
)

   original  len
0     кошка    5
1    собака    6
2    ЯБЛОКО    6
3  АПЕЛЬСИН    8
4    Дерево    6
5    Машина    6
6       Car    3
7     House    5
8       Дом    3
9     кошка    5

### Обновление и очистка данных

##### Удаление столбца из DataFrame

In [254]:
df = df.assign(len_word_col = df.word_col.str.len())

In [255]:
df

   int_col   num_col chr_col  word_col   mix_col  len_word_col
0        7  0.581952   чиьфс     кошка     чиьфс             5
1        5  0.401379   ьюжыз    собака     кошка             6
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301             6
3        5  0.515563   хцпхг  АПЕЛЬСИН         5             8
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО             6
5        2  0.577025   жеикф    Машина         7             6
6        1  0.224206   шмимо       Car  АПЕЛЬСИН             3
7        2  0.221537   елчжз     House         4             5
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН             3
9        6  0.971932   ытлфь     кошка     ьюжыз             5

In [256]:
del df['len_word_col']

In [257]:
df

   int_col   num_col chr_col  word_col   mix_col
0        7  0.581952   чиьфс     кошка     чиьфс
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
9        6  0.971932   ытлфь     кошка     ьюжыз

##### Изменение названия нескольких столюцов DataFrame

In [259]:
df = df.rename(columns= {
    'mix_col': 'MIX_col',
    'int_col': 'int_COL'
})
df

   int_COL   num_col chr_col  word_col   MIX_col
0        7  0.581952   чиьфс     кошка     чиьфс
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
9        6  0.971932   ытлфь     кошка     ьюжыз

##### Нижний регистр всех названий колонок DataFrame

In [260]:
df.columns = map(str.lower, df.columns)
df

   int_col   num_col chr_col  word_col   mix_col
0        7  0.581952   чиьфс     кошка     чиьфс
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
9        6  0.971932   ытлфь     кошка     ьюжыз

In [263]:
# inplace=True применит изменения в датасете
df.rename(columns=lambda x: x.split('_')[0], inplace=False)

   int       num    chr      word       mix
0    7  0.581952  чиьфс     кошка     чиьфс
1    5  0.401379  ьюжыз    собака     кошка
2    4  0.913010  шцйжы    ЯБЛОКО   0.91301
3    5  0.515563  хцпхг  АПЕЛЬСИН         5
4    5  0.418918  иьчщд    Дерево    ЯБЛОКО
5    2  0.577025  жеикф    Машина         7
6    1  0.224206  шмимо       Car  АПЕЛЬСИН
7    2  0.221537  елчжз     House         4
8    4  0.652998  пнфкц       Дом  АПЕЛЬСИН
9    6  0.971932  ытлфь     кошка     ьюжыз

##### Сортировка DataFrame по нескольким колонкам

In [268]:
df.sort_values(['mix_col', 'num_col'], ascending=[0, 1])

   int_col   num_col chr_col  word_col   mix_col
9        6  0.971932   ытлфь     кошка     ьюжыз
0        7  0.581952   чиьфс     кошка     чиьфс
1        5  0.401379   ьюжыз    собака     кошка
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
5        2  0.577025   жеикф    Машина         7
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
7        2  0.221537   елчжз     House         4
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301

##### Замена всех NaNs на None (полезно перед загрузкой в БД)

In [282]:
tmp_df = pd.DataFrame(
    [
        [1, '    2  ', np.nan], 
        [np.nan, ' data ', np.nan]
    ])
tmp_df.where((pd.notnull(tmp_df)), None)

      0        1     2
0     1      2    None
1  None    data   None

##### Больше предварительной очистки вставки db ... сделайте проход через DataFrame, убрав пробелы из строк и изменив все пустые значения на None

In [288]:
tmp_df.iloc[0][1]

'    2  '

In [290]:
tmp_df.applymap(lambda x: str(x).strip() if len(str(x).strip()) else None).iloc[0][1]

'2'

##### Замена всех не числовых значений на прочерк '-'

In [314]:
df2 = df.copy()

for col in df2.columns.values:
    df2[col] = df2[col].replace(r"^\w*$", '-', regex=True)

df2

   int_col   num_col chr_col word_col  mix_col
0        7  0.581952       -        -        -
1        5  0.401379       -        -        -
2        4  0.913010       -        -  0.91301
3        5  0.515563       -        -        5
4        5  0.418918       -        -        -
5        2  0.577025       -        -        7
6        1  0.224206       -        -        -
7        2  0.221537       -        -        4
8        4  0.652998       -        -        -
9        6  0.971932       -        -        -

##### Присвоение колонке DataFrame значения в зависимости от значений остальных колонок

In [329]:
df2 = df.copy()
my_filter = (df2['int_col'] >=5) & (df2['word_col'] == 'кошка') 
column_to_change = 'mix_col'

df2.loc[my_filter, [column_to_change]] = 'сфинкс'
df2

   int_col   num_col chr_col  word_col   mix_col
0        7  0.581952   чиьфс     кошка    сфинкс
1        5  0.401379   ьюжыз    собака     кошка
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301
3        5  0.515563   хцпхг  АПЕЛЬСИН         5
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО
5        2  0.577025   жеикф    Машина         7
6        1  0.224206   шмимо       Car  АПЕЛЬСИН
7        2  0.221537   елчжз     House         4
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН
9        6  0.971932   ытлфь     кошка    сфинкс

##### Заполнение пропущенных значений в нескольких столбцах специфическими значениями

In [336]:
tmp_df = pd.DataFrame(
    [
        [1, '    2  ', np.nan], 
        [np.nan, ' data ', np.nan],
        [' data ', np.nan, np.nan],
        [np.nan, ' data ', '231'],
    ], columns=['col1', 'col2', 'col3'])
tmp_df

     col1     col2 col3
0       1      2    NaN
1     NaN    data   NaN
2   data       NaN  NaN
3     NaN    data   231

In [338]:
tmp_df.fillna({
    'col1': 'пусто',
    'col3': '999'
})

     col1     col2 col3
0       1      2    999
1   пусто    data   999
2   data       NaN  999
3   пусто    data   231

##### Выполнение расчетов со столбцами DataFrame, в которых отсутствуют значения

In [348]:
tmp_df['new_col'] = np.where(
    pd.isnull(tmp_df['col3']), 0, tmp_df['col3']
).astype('int32') * 2
tmp_df

     col1     col2 col3  new_col
0       1      2    NaN        0
1     NaN    data   NaN        0
2   data       NaN  NaN        0
3     NaN    data   231      462

##### Разделить значения в столбце DataFrame на два новых столбца

In [351]:
df2 = df.copy()
df2['new_col1'], df2['new_col2'] = zip(
    *df2['num_col'].apply(
        lambda x: str(x).split('.', 1)
    )
)
df2

   int_col   num_col chr_col  word_col   mix_col new_col1           new_col2
0        7  0.581952   чиьфс     кошка     чиьфс        0   5819520280440198
1        5  0.401379   ьюжыз    собака     кошка        0   4013787731727625
2        4  0.913010   шцйжы    ЯБЛОКО   0.91301        0   9130104408214264
3        5  0.515563   хцпхг  АПЕЛЬСИН         5        0    515563406478504
4        5  0.418918   иьчщд    Дерево    ЯБЛОКО        0   4189177063087276
5        2  0.577025   жеикф    Машина         7        0   5770247675512845
6        1  0.224206   шмимо       Car  АПЕЛЬСИН        0  22420620475925346
7        2  0.221537   елчжз     House         4        0  22153708323941823
8        4  0.652998   пнфкц       Дом  АПЕЛЬСИН        0   6529981416907323
9        6  0.971932   ытлфь     кошка     ьюжыз        0    971932217361423

In [368]:
df2 = df.copy()
df2[['new_col1', 'new_col2']] = df2['num_col'].astype('str').str.split('.', 1, True)

df2[['num_col','new_col1', 'new_col2']]

   num_col new_col1           new_col2
0    0.582        0   5819520280440198
1    0.401        0   4013787731727625
2    0.913        0   9130104408214264
3    0.516        0    515563406478504
4    0.419        0   4189177063087276
5    0.577        0   5770247675512845
6    0.224        0  22420620475925346
7    0.222        0  22153708323941823
8    0.653        0   6529981416907323
9    0.972        0    971932217361423

### Отображение и форматирование

##### Настройте форматирование так, чтобы большие числа не отображались в научной нотации

In [371]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [367]:
df

   int_col  num_col chr_col  word_col   mix_col
0        7    0.582   чиьфс     кошка     чиьфс
1        5    0.401   ьюжыз    собака     кошка
2        4    0.913   шцйжы    ЯБЛОКО     0.913
3        5    0.516   хцпхг  АПЕЛЬСИН         5
4        5    0.419   иьчщд    Дерево    ЯБЛОКО
5        2    0.577   жеикф    Машина         7
6        1    0.224   шмимо       Car  АПЕЛЬСИН
7        2    0.222   елчжз     House         4
8        4    0.653   пнфкц       Дом  АПЕЛЬСИН
9        6    0.972   ытлфь     кошка     ьюжыз

In [379]:
pd.options.display.float_format = '{:,.2f}'.format
# pd.options.display.float_format = None

In [380]:
df

   int_col  num_col chr_col  word_col   mix_col
0        7     0.58   чиьфс     кошка     чиьфс
1        5     0.40   ьюжыз    собака     кошка
2        4     0.91   шцйжы    ЯБЛОКО      0.91
3        5     0.52   хцпхг  АПЕЛЬСИН         5
4        5     0.42   иьчщд    Дерево    ЯБЛОКО
5        2     0.58   жеикф    Машина         7
6        1     0.22   шмимо       Car  АПЕЛЬСИН
7        2     0.22   елчжз     House         4
8        4     0.65   пнфкц       Дом  АПЕЛЬСИН
9        6     0.97   ытлфь     кошка     ьюжыз